cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'

tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'homebrew/versions'

brew 'ansible'
brew 'assh'
brew 'coreutils'
brew 'curl'
brew 'go'
brew 'grc'
brew 'docker'
brew 'docker-machine'
brew 'docker-compose'
brew 'imagemagick'
brew 'md5sha1sum'
brew 'libgit2'
brew 'openssl'
brew 'mas'
brew 'node'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'python'
brew 'tmate'
brew 'unrar'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
brew 'grep'
brew 'make'
brew 'brew-cask-completion'
brew 'ncurses'
brew 'nano'
brew 'unzip'
brew 'whois'

brew 'homebrew/php/php56'
brew 'homebrew/php/php56-xdebug'
brew 'homebrew/php/php70'
brew 'homebrew/php/php70-imagick'
brew 'homebrew/php/php70-xdebug'
brew 'homebrew/php/php71'

cask '1password'
cask 'cleanmymac'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'gpgtools'
cask 'phpstorm'
cask 'poedit'
cask 'sequel-pro'
cask 'slack'
cask 'skype'
cask 'sublime-text'
cask 'transmit'
cask 'tower'
cask 'quicklook-json'
cask 'qlmarkdown'
cask 'qlcolorcode'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'keybase'
cask 'bartender'
cask 'alfred'
cask 'visual-studio-code'
cask 'flux'
cask 'coconutbattery'
cask 'firefox'
cask 'atom'

mas 'Xcode', id: 497799835
mas 'Harvest', id: 506189836
mas 'CheatSheet', id: 529456740
mas 'Caffeine', id: 411246225
mas '1Password', id: 443987910
mas 'Divvy', id: 413857545
mas 'iA Writer', id: 775737590
mas 'Bear', id: 1091189122
mas 'The Unarchiver', id: 425424353
mas 'Things3', id: 904280696
mas 'Pixelmator', id: 407963104
mas 'iPhoto', id: 408981381
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'iMovie', id: 408981434
mas 'Twitter', id: 409789998